Revit 2027 API
BuiltInFailures.EditingFailures.WorksetHasChangedInCentralFile Property
 This workset has changed in the Central Model. Please Reload Latest before making this workset editable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WorksetHasChangedInCentralFile { get; }
Public Shared ReadOnly Property WorksetHasChangedInCentralFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WorksetHasChangedInCentralFile {
	FailureDefinitionId^ get ();
}
static member WorksetHasChangedInCentralFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace